In [1]:
import psycopg2 as pg2
conn = pg2.connect(database='Budget', user='postgres', password="Dh41144185")

In [2]:
cur = conn.cursor()

In [3]:
cur.execute("CREATE TABLE IF NOT EXISTS test_table \
            (transaction_id SERIAL UNIQUE PRIMARY KEY,\
            date DATE NOT NULL,\
            account VARCHAR(50) NOT NULL,\
            transaction_name TEXT,\
            amount NUMERIC(13,2) NOT NULL,\
            category VARCHAR(50));")
conn.commit()

In [4]:
conn.rollback()

In [5]:
cur.execute("SELECT * FROM test_table")
results = cur.fetchall()
results

[(1,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (2,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (3,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (4,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food')]

In [6]:
# cur.execute("""INSERT INTO test_table (date, account, transaction_name, amount, category)
#             VALUES
#             ('01-15-2013', 'CHASE_CHECKING', 'McDonalds', 10.13, 'Food'),
#             ('01-20-2013', 'CAPITAL_ONE', 'Walmart', 58.56, 'Grocery'),
#             ('01-23-2013', 'CHASE_CHECKING', 'IKEA', 350.65, 'Free_Expense'),
#             ('01-29-2013', 'CHASE_CHECKING', 'Wendys', 6.53, 'Food');""")
# conn.commit()

In [7]:
cur.execute("SELECT * FROM test_table")
results = cur.fetchall()
conn.rollback()
results

[(1,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (2,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (3,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (4,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food'),
 (5,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (6,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (7,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (8,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food')]

In [8]:
import pandas as pd
df = pd.DataFrame(results)

In [9]:
df

   0           1               2          3       4             5
0  1  2013-01-15  CHASE_CHECKING  McDonalds   10.13          Food
1  2  2013-01-20     CAPITAL_ONE    Walmart   58.56       Grocery
2  3  2013-01-23  CHASE_CHECKING       IKEA  350.65  Free_Expense
3  4  2013-01-29  CHASE_CHECKING     Wendys    6.53          Food
4  5  2013-01-15  CHASE_CHECKING  McDonalds   10.13          Food
5  6  2013-01-20     CAPITAL_ONE    Walmart   58.56       Grocery
6  7  2013-01-23  CHASE_CHECKING       IKEA  350.65  Free_Expense
7  8  2013-01-29  CHASE_CHECKING     Wendys    6.53          Food

```sql
SELECT transaction_test.transaction_date, account_test.account, transaction_test.transaction_name, 
transaction_test.amount, category_test.category, sub_category_test.subcategory,
category_type_test.category_type
FROM transaction_test
INNER JOIN transaction_data_test
ON transaction_test.transaction_id = transaction_data_test.transaction_id
INNER JOIN account_test
ON account_test.account_id = transaction_data_test.account_id
INNER JOIN category_test
ON category_test.category_id = transaction_data_test.category_id
INNER JOIN sub_category_test
ON sub_category_test.sub_category_id = transaction_data_test.sub_category_id
INNER JOIN category_type_test
ON category_type_test.category_type_id = transaction_data_test.category_type_id
ORDER BY transaction_test.transaction_date;

### Let's try to create a scenario of tables for this project

In [10]:
data_category = [
    [1, "Food"],
    [2, "Transportation"],
    [3, "Grocery"],
    [4, "Investments"],
    [5, "Bills"],
    [6, "Free Expense"],
    [7, "Earnings"],
    [7, "Support"],
    [7, "Transfer"]
]
sub_category = [
    [, "Phone Bill"],
    [, "Car Insurance"],
    [, "Restaurant"],
    [,  "Restaurant Tip"],
    [, "Video Game"],
    [, "Fast Food"],
    [, "Grocery Store"],
    [, "Walmart"],
    [, "Donation"],
    [, "Gas"],
    [, "Credit Card payment"],
    [, "Student Loan 1"],
    [, "Student Loan 2"],
    [, "Back-a-Boiler"],
    [, "Salary"],
    [, "Comission"],
    [, "Charity"],
    [, "Car Maintenance"],
    [, "Business Expense"],
    [, "Taxes"],
    [, "Car Expense"],
    [, "Rent"],
    [, "Crypto Investment"],
    [, "Stock Investment"],
    [, "Hygiene"],
    [, "Savings Transfer"],
    [, "Entertainment"],
    [, "Gift"],
    [, "Book"],
    [, "Subscription Renewal"],
    [, "Snack"],
    [, "Clothes"],
    [, "Electronics"],
    [, "Course"],
    [, "Misc. Free Expense"],
    [, "Costco"],
    [, "Sam's Club"]
]




category = pd.Dataframe()

AttributeError: module 'pandas' has no attribute 'Dataframe'